; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	infrared1 - mode
	infrared2 - mode
	image0 - mode
	Star0 - direction
	GroundStation7 - direction
	Star4 - direction
	Star2 - direction
	Star5 - direction
	GroundStation3 - direction
	GroundStation6 - direction
	GroundStation1 - direction
	Star8 - direction
	Star9 - direction
	Planet10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 image0)
	(supports instrument0 infrared2)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 Star4)
	(supports instrument1 infrared1)
	(supports instrument1 infrared2)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation6)
	(supports instrument2 infrared1)
	(supports instrument2 infrared2)
	(supports instrument2 image0)
	(calibration_target instrument2 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument3 image0)
	(calibration_target instrument3 Star5)
	(supports instrument4 image0)
	(supports instrument4 infrared1)
	(supports instrument4 infrared2)
	(calibration_target instrument4 GroundStation6)
	(calibration_target instrument4 GroundStation3)
	(supports instrument5 infrared1)
	(supports instrument5 image0)
	(supports instrument5 infrared2)
	(calibration_target instrument5 GroundStation1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation3)
)
(:goal (and
	(have_image Star8 infrared2)
	(have_image Star9 image0)
	(have_image Planet10 infrared1)
	(have_image Star11 infrared2)
	(have_image Phenomenon12 infrared2)
	(have_image Planet13 infrared2)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
2. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 0 of 6
3. (turn_to satellite0 planet10 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 planet10)
   goals met: 0 of 6
4. (take_image satellite0 planet10 instrument0 infrared1)
   added: (have_image planet10 infrared1)
   goals met: 1 of 6
5. (turn_to satellite0 phenomenon12 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon12)
   goals met: 1 of 6
6. (take_image satellite0 phenomenon12 instrument0 infrared2)
   added: (have_image phenomenon12 infrared2)
   goals met: 2 of 6
7. (turn_to satellite0 planet13 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 planet13)
   goals met: 2 of 6
8. (take_image satellite0 planet13 instrument0 infrared2)
   added: (have_image planet13 infrared2)
   goals met: 3 of 6
9. (turn_to satellite0 star11 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 star11)
   goals met: 3 of 6
10. (take_image satellite0 star11 instrument0 infrared2)
   added: (have_image star11 infrared2)
   goals met: 4 of 6
11. (turn_to satellite0 star8 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star8)
   goals met: 4 of 6
12. (take_image satellite0 star8 instrument0 infrared2)
   added: (have_image star8 infrared2)
   goals met: 5 of 6
13. (turn_to satellite0 star9 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star9)
   goals met: 5 of 6
14. (take_image satellite0 star9 instrument0 image0)
   added: (have_image star9 image0)
   goals met: 6 of 6
